<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages.
    |
    */

    'accepted'        => 'تایبەتمەندی :پێویستە پەسەند بکرێت',
    'active_url'      => "ێکی نادروستەURL:تایبەتمەندی",
    'after'           => 'تایبەتمەندی :پێویستە بەروارێک بێت دوای ',
    'after_or_equal'  => 'تایبەتمەندی :پێویستە بەروارێک بێت دوای یان یەکسان بێت بە : بەروار ',
    'alpha'           => '.تایبەتمەندی: لەوانەیە تەنها پیتەکانی تێدابێت',
    'alpha_dash'      => '.تایبەتمەندی :لەوانەیە تەنها پیتەکان، ژمارەکان، داشەکان و ژێرهێڵەکان لەخۆ بگرێت',
    'alpha_num'       => '.تایبەتمەندی: لەوانەیە تەنها پیتەکان، ژمارەکان، داشەکان و ژێرهێڵەکان لەخۆ بگرێت',
    'array'           => '.تایبەتمەندی :لەوانەیە تەنها پیت و ژمارەکانی تێدابێت',
    'before'          => 'خەسڵەت:پێویستە ڕیزبەند بێت.',
    'before_or_equal' => '.تایبەتمەندی :پێویستە بەروارێک بێت پێش یان یەکسان بێت بە : بەروار',
    'between'         => [
        'numeric' => '.تایبەتمەندی :پێویستە لە نێوان گەورەترین و بچووکترین بێت',
        'file'    => '.تایبەتمەندی :پێویستە لە نێوان گەورەترین و بچوکترین کیلۆبایت بێت',
        'string'  => '.تایبەتمەندی :پێویستە لە نێوان گەورەترین و بچوکترین پیتەکان بێت',
        'array'   => '.تایبەتمەندی :پێویستە هەبێت لە نێوان بچوکترین و گەورەترین ئایتمەکان هەبێت',
    ],
    'boolean'        => '.خانەی : خەسڵەت دەبێت ڕاست بێت یان هەڵە بێت',
    'confirmed'      => '.دووپاتکردنەوەی تایبەتمەندیەکە ناگونجێت',
    'date'           => ".خەسڵەت :خەسڵەت بەروارێکی دروست نییە",
    'date_equals'    => '.تایبەتمەندی :پێویستە بەروارێک بێت یەکسان بێت بە : بەروار',
    'date_format'    => '.تایبەتمەندی :هاوتا نییە لەگەڵ فۆرمات: فۆرمات ',
    'different'      => '.خەسڵەت:و:ئەوانی تر دەبێت جیاواز بن',
    'digits'         => '.تایبەتمەندیەکە دەبێ ژمارەیی بێت',
    'digits_between' => 'تایبەتمەندیەکە دەبێت لە نێوان ژمارە بچووک و گەورە بێت',
    'dimensions'     => "تایبەتمەندیەکە ڕەهەندی وێنەی نادروستی هەیە",
    'distinct'       => 'خانەی تایبەتمەندی بەهایەکی دووبارەیی هەیە',
    'email'          => 'تایبەتمەندیەکە دەبێت ئیمەیڵێکی بڕوادار بێت.',
    'ends_with'      => 'خەسڵەتەکە دەبێت بە یەکێک لەم بەهایانەی خوارەوە کۆتایی پێبێت',
    'exists'         => 'تایبەتمەندیە دیاریکراوەکە نادروستە',
    'file'           => 'تایبەتمەندیەکە دەبێت فایل بێت',
    'filled'         => 'خانەی تایبەتمەندی پێویستە بەهایەکی هەبێت',
    'gt'             => [
        'numeric' => 'تایبەتمەندیەکە دەبێت گەورەتر بێت لە بەها',
        'file'    => 'تایبەتمەندیەکە پێویستە گەورەتر بێت لە بەهای کیلۆبایت',
        'string'  => 'خەسڵەتەکە دەبێت گەورەتر بێت لە هێما بەهاکان',
        'array'   => 'تایبەتمەندیەکە دەبێت زیاتر لە بەهای بەندەکانی هەبێت',
    ],
    'gte' => [
        'numeric' => 'تایبەتمەندیەکە دەبێت گەورەتر یان یەکسان بێت بە بەها',
        'file'    => 'تایبەتمەندیەکە دەبێت لە کیلۆبایتی بەهای یەکسان یان گەورەتر بێت',
        'string'  => 'تایبەتمەندیەکە دەبێت گەورەتر یان یەکسان بێت لە پیتەکانی بەها',
        'array'   => 'تایبەتمەندیەکە پێویستە بڕگەکانی بەها یان زیاتریان هەبێت',
    ],
    'image'    => 'تایبەتمەندیەکە دەبێت وێنە بێت',
    'in'       => 'تایبەتمەندیە دیاریکراوەکە نادروستە',
    'in_array' => "بواری تایبەتمەندیەکە لە ئەویتردا بوونی نییە",
    'integer'  => 'تایبەتمەندیەکە پێویستە تەواوکەر بێت',
    'ip'       => 'دروست بێتIPتایبەتمەندیەکە پێویستە ناونیشانی ',
    'ipv4'     => 'دروست بێIPv4خەسڵەت:پێویستە ناونیشانی',
    'ipv6'     => ' دروست بێIPv6 تایبەتمەندیەکە پێویستە ناونیشانی ',
    'json'     => 'تایبەتمەندیەکە دەبێت زنجیرەیەکی بڕوادار بێت لە ئەی ئێم ئەی سی',
    'lt'       => [
        'numeric' => 'تایبەتمەندیەکە پێویستە کەمتر بێت لە بەها',
        'file'    => 'تایبەتمەندیەکە پێویستە کەمتر بێت لە بەهای کیلۆبایت',
        'string'  => 'تایبەتمەندیەکە پێویستە کەمتر بێت لە کارەکتەرەکانی بەها',
        'array'   => 'تایبەتمەندیەکە پێویستە کەمتر بێت لە بەهای بەندەکان',
    ],
    'lte' => [
        'numeric' => 'تایبەتمەندیەکە پێویستە کەمتر یان یەکسان بێت بە بەها',
        'file'    => 'تایبەتمەندیەکە پێویستە کەمتر یان یەکسان بێت بە بەهای کیلۆبایت',
        'string'  => 'تایبەتمەندیەکە پێویستە کەمتر یان یەکسان بێت بە بەها پیتەکان',
        'array'   => 'تایبەتمەندیەکە نابێت زیاتر لە بەهای بەندەکانی هەبێت',
    ],
    'max' => [
        'numeric' => 'تایبەتمەندیەکە لەوانەیە لە ماکس گەورەتر نەبێت',
        'file'    => 'تایبەتمەندیەکە لەوانەیە لە ماکس کیلۆبایت گەورەتر نەبێت',
        'string'  => 'تایبەتمەندیەکە لەوانەیە گەورەتر نەبێت لە پیتەکانی ماکس',
        'array'   => 'تایبەتمەندیەکە لەوانەیە زیاتر لە بڕگەکانی ماکس نەبێت',
    ],
    'mimes'     => 'تایبەتمەندیەکە دەبێت فایلێک بێت لە بەهاکانی جۆر',
    'mimetypes' => 'تایبەتمەندیەکە دەبێت فایلێک بێت لە بەهاکانی جۆر',
    'min'       => [
        'numeric' => 'تایبەتمەندیەکە دەبێت بەلایەنی کەمەوە بۆ خولەک بێت',
        'file'    => 'تایبەتمەندیەکە پێویستە بەلایەنی کەمەوە کیلۆبایت بێت',
        'string'  => 'تایبەتمەندیەکە دەبێت بەلایەنی کەمەوە پیتی بچووک بێت',
        'array'   => 'تایبەتمەندیەکە پێویستە بەلایەنی کەمەوە بڕگەی بچووکی هەبێت',
    ],
    'not_in'               => "تایبەتمەندیە دیاریکراوەکە نادروستە",
    'not_regex'            => "فۆرماتی تایبەتمەندی نادروستە",
    'numeric'              => 'تایبەتمەندیەکە دەبێت ژمارە بێت',
    'password'             => 'وشەنهێنییەکە نادروستە',
    'present'              => 'خانەی تایبەتمەندی پێویستە ئامادەبێت',
    'regex'                => 'فۆرماتی تایبەتمەندی نادروستە',
    'required'             => 'خانەی تایبەتمەندی پێویستە',
    'required_if'          => 'خانەی تایبەتمەندی پێویستە کاتێک کەی تر بەها بێت',
    'required_unless'      => 'خانەی تایبەتمەندی پێویستە مەگەر ئەوەی تر لە بەهاکان بێت',
    'required_with'        => 'خانەی تایبەتمەندی پێویستە کاتێک بەهاکان ئامادەبن',
    'required_with_all'    => 'خانەی تایبەتمەندی پێویستە کاتێک بەهاکان ئامادەبن',
    'required_without'     => "خانەی تایبەتمەندی پێویستە کاتێک بەهاکان ئامادە نەبن",
    'required_without_all' => "خانەی تایبەتمەندی پێویستە کاتێک هیچ بەهایەک ئامادە نیە",
    'same'                 => 'تایبەتمەندی  و ئەوانی تر دەبێ هاوچەشن بن',
    'size'                 => [
        'numeric' => 'تایبەتمەندیەکە دەبێت قەبارە بێت',
        'file'    => 'تایبەتمەندیەکە پێویستە کیلۆبایتی قەبارە بێت',
        'string'  => 'تایبەتمەندیەکە دەبێت پیتی قەبارە بێت',
        'array'   => 'تایبەتمەندیەکە پێویستە بڕگەکانی قەبارە لەخۆبگرێت',
    ],
    'starts_with' => 'تایبەتمەندیەکە دەبێت بە یەکێک لەم بەهایانەی خوارەوە دەست پێ بکات',
    'string'      => 'تایبەتمەندیەکە دەبێ زنجیرەیەک بێت',
    'timezone'    => 'تایبەتمەندیەکە دەبێت ناوچەیەکی بڕوادار بێت',
    'unique'      => 'تایبەتمەندیەکە پێشتر وەرگیراوە',
    'uploaded'    => "تایبەتمەندیەکە سەرکەوتوو نەبوو لە بارکردن",
    'url'         => "فۆرماتی تایبەتمەندی نادروستە",
    'uuid'        => 'ێکی درست بێتUUIDتایبەتمەندیەکە پێویستە ',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attribute.rule" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap attribute place-holders
    | with something more reader friendly such as E-Mail Address instead
    | of "email". This simply helps us make messages a little cleaner.
    |
    */

    'attributes' => [
        'name'                  => 'ناو',
        'username'              => "ناوی بەکارهێنەر",
        'email'                 => 'ئیمەیڵ',
        'first_name'            => 'ناوی یەکەم',
        'last_name'             => 'ناوی دووەم',
        'password'              => 'وشەی نهێنی',
        'password_confirmation' => 'دووپاتکردنەوەی وشەی نهێنی',
        'city'                  => 'شار',
        'country'               => 'وڵات',
        'address'               => 'ناونیشان',
        'phone'                 => 'تەلەفۆن',
        'mobile'                => 'مۆبایل',
        'age'                   => 'تەمەن',
        'sex'                   => 'رەگەز',
        'gender'                => 'ڕەگەز',
        'day'                   => 'ڕۆژ',
        'month'                 => 'مانگ',
        'year'                  => 'ساڵ',
        'hour'                  => 'کاتژمێر',
        'minute'                => 'خولەک',
        'second'                => 'چرکە',
        'title'                 => 'ناونیشان',
        'content'               => 'ناوەڕۆک',
        'description'           => 'وەسف',
        'excerpt'               => 'پوختە',
        'date'                  => 'بەروار',
        'time'                  => 'کات',
        'available'             => 'بەردەستە',
        'size'                  => 'قەبارە',
    ],
];